#### Terraform Plan 📝

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_artifact_registry_repository.shorted will be updated in-place
  # (imported from "projects/shorted-dev-aba5688f/locations/australia-southeast2/repositories/shorted")
  ~ resource "google_artifact_registry_repository" "shorted" {
        cleanup_policy_dry_run = false
        create_time            = "2024-03-30T08:49:54.666382Z"
        description            = "Docker images for Shorted services"
        effective_labels       = {
            "environment" = "dev"
            "managed_by"  = "terraform"
        }
        format                 = "DOCKER"
        id                     = "projects/shorted-dev-aba5688f/locations/australia-southeast2/repositories/shorted"
      ~ labels                 = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
        location               = "australia-southeast2"
        mode                   = "STANDARD_REPOSITORY"
        name                   = "shorted"
        project                = "shorted-dev-aba5688f"
        repository_id          = "shorted"
      ~ terraform_labels       = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
        update_time            = "2026-03-03T08:17:30.780189Z"

      - cleanup_policies {
          - action = "DELETE" -> null
          - id     = "delete-old-images" -> null

          - condition {
              - older_than            = "2592000s" -> null
              - package_name_prefixes = [] -> null
              - tag_prefixes          = [] -> null
              - tag_state             = "TAG_STATE_UNSPECIFIED" -> null
              - version_name_prefixes = [] -> null
            }
        }
      - cleanup_policies {
          - action = "KEEP" -> null
          - id     = "keep-recent-versions" -> null

          - most_recent_versions {
              - keep_count            = 5 -> null
              - package_name_prefixes = [] -> null
            }
        }
    }

  # google_project_service.required_apis["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "shorted-dev-aba5688f"
      + service            = "artifactregistry.googleapis.com"
    }

  # google_project_service.required_apis["cloudscheduler.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "shorted-dev-aba5688f"
      + service            = "cloudscheduler.googleapis.com"
    }

  # google_project_service.required_apis["compute.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "shorted-dev-aba5688f"
      + service            = "compute.googleapis.com"
    }

  # google_project_service.required_apis["iam.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "shorted-dev-aba5688f"
      + service            = "iam.googleapis.com"
    }

  # google_project_service.required_apis["pubsub.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "shorted-dev-aba5688f"
      + service            = "pubsub.googleapis.com"
    }

  # google_project_service.required_apis["run.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "shorted-dev-aba5688f"
      + service            = "run.googleapis.com"
    }

  # google_project_service.required_apis["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "shorted-dev-aba5688f"
      + service            = "secretmanager.googleapis.com"
    }

  # time_sleep.wait_for_apis will be created
  + resource "time_sleep" "wait_for_apis" {
      + create_duration = "60s"
      + id              = (known after apply)
    }

  # module.asx_announcement_crawler.google_cloud_run_v2_job.asx_announcement_crawler will be created
  + resource "google_cloud_run_v2_job" "asx_announcement_crawler" {
      + conditions               = (known after apply)
      + create_time              = (known after apply)
      + creator                  = (known after apply)
      + delete_time              = (known after apply)
      + effective_annotations    = (known after apply)
      + effective_labels         = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "service"     = "asx-announcement-crawler"
        }
      + etag                     = (known after apply)
      + execution_count          = (known after apply)
      + expire_time              = (known after apply)
      + generation               = (known after apply)
      + id                       = (known after apply)
      + labels                   = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "service"     = "asx-announcement-crawler"
        }
      + last_modifier            = (known after apply)
      + latest_created_execution = (known after apply)
      + launch_stage             = (known after apply)
      + location                 = "australia-southeast2"
      + name                     = "asx-announcement-crawler"
      + observed_generation      = (known after apply)
      + project                  = "shorted-dev-aba5688f"
      + reconciling              = (known after apply)
      + terminal_condition       = (known after apply)
      + terraform_labels         = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "service"     = "asx-announcement-crawler"
        }
      + uid                      = (known after apply)
      + update_time              = (known after apply)

      + template {
          + parallelism = (known after apply)
          + task_count  = 1

          + template {
              + execution_environment = (known after apply)
              + max_retries           = 2
              + service_account       = (known after apply)
              + timeout               = "3600s"

              + containers {
                  + args  = [
                      + "-director-trades",
                      + "-dividends",
                      + "-news-table",
                      + "-years",
                      + "2024,2025,2026",
                    ]
                  + image = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/asx-announcement-crawler:pr-84"

                  + env {
                      + name  = "ENVIRONMENT"
                      + value = "dev"
                    }
                  + env {
                      + name = "DATABASE_URL"

                      + value_source {
                          + secret_key_ref {
                              + secret  = "DATABASE_URL"
                              + version = "latest"
                            }
                        }
                    }
                  + env {
                      + name  = "OTEL_EXPORTER_OTLP_ENDPOINT"
                      + value = "https://otlp-gateway-prod-au-southeast-1.grafana.net/otlp"
                    }
                  + env {
                      + name  = "OTEL_EXPORTER_OTLP_PROTOCOL"
                      + value = "http/protobuf"
                    }
                  + env {
                      + name = "OTEL_EXPORTER_OTLP_HEADERS"

                      + value_source {
                          + secret_key_ref {
                              + secret  = "OTEL_EXPORTER_OTLP_HEADERS"
                              + version = "latest"
                            }
                        }
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "1Gi"
                        }
                    }
                }
            }
        }
    }

  # module.asx_announcement_crawler.google_cloud_run_v2_job_iam_member.scheduler_invoker will be created
  + resource "google_cloud_run_v2_job_iam_member" "scheduler_invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "australia-southeast2"
      + member   = (known after apply)
      + name     = "asx-announcement-crawler"
      + project  = "shorted-dev-aba5688f"
      + role     = "roles/run.invoker"
    }

  # module.asx_announcement_crawler.google_cloud_scheduler_job.asx_announcement_crawler will be created
  + resource "google_cloud_scheduler_job" "asx_announcement_crawler" {
      + attempt_deadline = "1800s"
      + description      = "Daily crawl of ASX announcements for director trades, dividends, and news"
      + id               = (known after apply)
      + name             = "asx-announcement-crawler-daily"
      + paused           = (known after apply)
      + project          = "shorted-dev-aba5688f"
      + region           = "australia-southeast1"
      + schedule         = "0 11 * * *"
      + state            = (known after apply)
      + time_zone        = "UTC"

      + http_target {
          + http_method = "POST"
          + uri         = "https://australia-southeast2-run.googleapis.com/apis/run.googleapis.com/v1/namespaces/shorted-dev-aba5688f/jobs/asx-announcement-crawler:run"

          + oauth_token {
              + service_account_email = (known after apply)
            }
        }

      + retry_config {
          + max_backoff_duration = "1800s"
          + max_doublings        = (known after apply)
          + max_retry_duration   = "3600s"
          + min_backoff_duration = "10s"
          + retry_count          = 2
        }
    }

  # module.asx_announcement_crawler.google_secret_manager_secret_iam_member.database_url will be created
  + resource "google_secret_manager_secret_iam_member" "database_url" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = "shorted-dev-aba5688f"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "DATABASE_URL"
    }

  # module.asx_announcement_crawler.google_secret_manager_secret_iam_member.otel_headers will be created
  + resource "google_secret_manager_secret_iam_member" "otel_headers" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = "shorted-dev-aba5688f"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "OTEL_EXPORTER_OTLP_HEADERS"
    }

  # module.asx_announcement_crawler.google_service_account.asx_announcement_crawler will be created
  + resource "google_service_account" "asx_announcement_crawler" {
      + account_id   = "asx-announcement-crawler"
      + description  = "Service account for crawling ASX announcements"
      + disabled     = false
      + display_name = "ASX Announcement Crawler"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "shorted-dev-aba5688f"
      + unique_id    = (known after apply)
    }

  # module.asx_announcement_crawler.google_service_account.scheduler_invoker will be created
  + resource "google_service_account" "scheduler_invoker" {
      + account_id   = "asx-announcement-crawler-sched"
      + description  = "Service account for Cloud Scheduler to invoke ASX announcement crawler"
      + disabled     = false
      + display_name = "ASX Announcement Crawler Scheduler"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "shorted-dev-aba5688f"
      + unique_id    = (known after apply)
    }

  # module.enrichment_processor.google_cloud_run_v2_service.enrichment_processor will be created
  + resource "google_cloud_run_v2_service" "enrichment_processor" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "environment" = "production"
          + "managed_by"  = "terraform"
          + "service"     = "enrichment-processor"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + labels                  = {
          + "environment" = "production"
          + "managed_by"  = "terraform"
          + "service"     = "enrichment-processor"
        }
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "australia-southeast2"
      + name                    = "enrichment-processor"
      + observed_generation     = (known after apply)
      + project                 = "shorted-dev-aba5688f"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "environment" = "production"
          + "managed_by"  = "terraform"
          + "service"     = "enrichment-processor"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/enrichment-processor:pr-84"

              + env {
                  + name  = "GCP_PROJECT_ID"
                  + value = "shorted-dev-aba5688f"
                }
              + env {
                  + name = "IMAGE_TAG"
                }
              + env {
                  + name  = "ENRICHMENT_PUBSUB_TOPIC"
                  + value = "enrichment-jobs"
                }
              + env {
                  + name  = "ENRICHMENT_PUBSUB_SUBSCRIPTION"
                  + value = "enrichment-jobs-subscription"
                }
              + env {
                  + name  = "APP_STORE_POSTGRES_ADDRESS"
                  + value = "aws-0-ap-southeast-2.pooler.supabase.com:6543"
                }
              + env {
                  + name  = "APP_STORE_POSTGRES_DATABASE"
                  + value = "postgres"
                }
              + env {
                  + name  = "APP_STORE_POSTGRES_USERNAME"
                  + value = "postgres.xivfykscsdagwsreyqgf"
                }
              + env {
                  + name = "APP_STORE_POSTGRES_PASSWORD"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "APP_STORE_POSTGRES_PASSWORD"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "OPENAI_API_KEY"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "OPENAI_API_KEY"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "GCS_LOGO_BUCKET"
                  + value = "shorted-company-logos"
                }
              + env {
                  + name  = "SHORTS_API_URL"
                  + value = (known after apply)
                }
              + env {
                  + name = "INTERNAL_SERVICE_SECRET"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "INTERNAL_SERVICE_SECRET"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "OTEL_EXPORTER_OTLP_ENDPOINT"
                  + value = "https://otlp-gateway-prod-au-southeast-1.grafana.net/otlp"
                }
              + env {
                  + name  = "OTEL_EXPORTER_OTLP_PROTOCOL"
                  + value = "http/protobuf"
                }
              + env {
                  + name = "OTEL_EXPORTER_OTLP_HEADERS"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "OTEL_EXPORTER_OTLP_HEADERS"
                          + version = "latest"
                        }
                    }
                }

              + liveness_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 30
                  + period_seconds        = 30
                  + timeout_seconds       = 10

                  + http_get {
                      + path = "/health"
                      + port = 8080
                    }
                }

              + ports {
                  + container_port = 8080
                  + name           = "http1"
                }

              + resources {
                  + cpu_idle          = true
                  + limits            = {
                      + "cpu"    = "4"
                      + "memory" = "8Gi"
                    }
                  + startup_cpu_boost = true
                }

              + startup_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 15
                  + period_seconds        = 10
                  + timeout_seconds       = 5

                  + http_get {
                      + path = "/health"
                      + port = 8080
                    }
                }
            }

          + scaling {
              + max_instance_count = 5
              + min_instance_count = 0
            }
        }
    }

  # module.enrichment_processor.google_cloud_run_v2_service_iam_member.enrichment_processor_invoker will be created
  + resource "google_cloud_run_v2_service_iam_member" "enrichment_processor_invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "australia-southeast2"
      + member   = (known after apply)
      + name     = "enrichment-processor"
      + project  = "shorted-dev-aba5688f"
      + role     = "roles/run.invoker"
    }

  # module.enrichment_processor.google_pubsub_subscription.enrichment_jobs will be created
  + resource "google_pubsub_subscription" "enrichment_jobs" {
      + ack_deadline_seconds       = 600
      + effective_labels           = {
          + "environment" = "production"
          + "managed_by"  = "terraform"
          + "service"     = "enrichment-processor"
        }
      + id                         = (known after apply)
      + labels                     = {
          + "environment" = "production"
          + "managed_by"  = "terraform"
          + "service"     = "enrichment-processor"
        }
      + message_retention_duration = "86400s"
      + name                       = "enrichment-jobs-subscription"
      + project                    = "shorted-dev-aba5688f"
      + terraform_labels           = {
          + "environment" = "production"
          + "managed_by"  = "terraform"
          + "service"     = "enrichment-processor"
        }
      + topic                      = "enrichment-jobs"
    }

  # module.enrichment_processor.google_pubsub_subscription_iam_member.processor_subscriber will be created
  + resource "google_pubsub_subscription_iam_member" "processor_subscriber" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + project      = "shorted-dev-aba5688f"
      + role         = "roles/pubsub.subscriber"
      + subscription = "enrichment-jobs-subscription"
    }

  # module.enrichment_processor.google_pubsub_topic.enrichment_jobs will be created
  + resource "google_pubsub_topic" "enrichment_jobs" {
      + effective_labels = {
          + "environment" = "production"
          + "managed_by"  = "terraform"
          + "service"     = "enrichment-processor"
        }
      + id               = (known after apply)
      + labels           = {
          + "environment" = "production"
          + "managed_by"  = "terraform"
          + "service"     = "enrichment-processor"
        }
      + name             = "enrichment-jobs"
      + project          = "shorted-dev-aba5688f"
      + terraform_labels = {
          + "environment" = "production"
          + "managed_by"  = "terraform"
          + "service"     = "enrichment-processor"
        }
    }

  # module.enrichment_processor.google_secret_manager_secret_iam_member.internal_service_secret will be created
  + resource "google_secret_manager_secret_iam_member" "internal_service_secret" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = "shorted-dev-aba5688f"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "INTERNAL_SERVICE_SECRET"
    }

  # module.enrichment_processor.google_secret_manager_secret_iam_member.openai_api_key will be created
  + resource "google_secret_manager_secret_iam_member" "openai_api_key" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = "shorted-dev-aba5688f"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "OPENAI_API_KEY"
    }

  # module.enrichment_processor.google_secret_manager_secret_iam_member.otel_headers will be created
  + resource "google_secret_manager_secret_iam_member" "otel_headers" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = "shorted-dev-aba5688f"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "OTEL_EXPORTER_OTLP_HEADERS"
    }

  # module.enrichment_processor.google_secret_manager_secret_iam_member.postgres_password will be created
  + resource "google_secret_manager_secret_iam_member" "postgres_password" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = "shorted-dev-aba5688f"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "APP_STORE_POSTGRES_PASSWORD"
    }

  # module.enrichment_processor.google_service_account.enrichment_processor will be created
  + resource "google_service_account" "enrichment_processor" {
      + account_id   = "enrichment-processor"
      + description  = "Service account for processing enrichment jobs"
      + disabled     = false
      + display_name = "Enrichment Processor Job"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "shorted-dev-aba5688f"
      + unique_id    = (known after apply)
    }

  # module.grafana_dashboards.grafana_dashboard.operations will be created
  + resource "grafana_dashboard" "operations" {
      + config_json  = jsonencode(
            {
              + description = "Operational dashboard for Shorted API and frontend"
              + editable    = true
              + panels      = [
                  + {
                      + collapsed = false
                      + gridPos   = {
                          + h = 1
                          + w = 24
                          + x = 0
                          + y = 0
                        }
                      + title     = "API Overview"
                      + type      = "row"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + custom = {
                                  + drawStyle   = "line"
                                  + fillOpacity = 10
                                  + lineWidth   = 2
                                }
                              + unit   = "reqps"
                            }
                        }
                      + gridPos     = {
                          + h = 8
                          + w = 12
                          + x = 0
                          + y = 1
                        }
                      + targets     = [
                          + {
                              + expr         = "sum(rate(rpc_server_requests_total{job=~\"$service\"}[$__rate_interval])) by (job, rpc_method)"
                              + legendFormat = "{{ job }} / {{ rpc_method }}"
                              + refId        = "A"
                            },
                        ]
                      + title       = "RPC Request Rate"
                      + type        = "timeseries"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + custom = {
                                  + drawStyle   = "line"
                                  + fillOpacity = 5
                                  + lineWidth   = 2
                                }
                              + unit   = "ms"
                            }
                        }
                      + gridPos     = {
                          + h = 8
                          + w = 12
                          + x = 12
                          + y = 1
                        }
                      + targets     = [
                          + {
                              + expr         = "histogram_quantile(0.50, sum(rate(rpc_server_duration_milliseconds_bucket{job=~\"$service\"}[$__rate_interval])) by (le))"
                              + legendFormat = "p50"
                              + refId        = "A"
                            },
                          + {
                              + expr         = "histogram_quantile(0.95, sum(rate(rpc_server_duration_milliseconds_bucket{job=~\"$service\"}[$__rate_interval])) by (le))"
                              + legendFormat = "p95"
                              + refId        = "B"
                            },
                          + {
                              + expr         = "histogram_quantile(0.99, sum(rate(rpc_server_duration_milliseconds_bucket{job=~\"$service\"}[$__rate_interval])) by (le))"
                              + legendFormat = "p99"
                              + refId        = "C"
                            },
                        ]
                      + title       = "RPC Duration (p50 / p95 / p99)"
                      + type        = "timeseries"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + color  = {
                                  + fixedColor = "red"
                                  + mode       = "fixed"
                                }
                              + custom = {
                                  + drawStyle   = "bars"
                                  + fillOpacity = 50
                                  + lineWidth   = 1
                                }
                              + unit   = "reqps"
                            }
                        }
                      + gridPos     = {
                          + h = 8
                          + w = 8
                          + x = 0
                          + y = 9
                        }
                      + targets     = [
                          + {
                              + expr         = "sum(rate(rpc_server_requests_total{job=~\"$service\", rpc_connect_status_code!=\"ok\"}[$__rate_interval])) by (job, rpc_connect_status_code)"
                              + legendFormat = "{{ job }} / {{ rpc_connect_status_code }}"
                              + refId        = "A"
                            },
                        ]
                      + title       = "RPC Error Rate"
                      + type        = "timeseries"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + custom = {
                                  + drawStyle   = "line"
                                  + fillOpacity = 5
                                  + lineWidth   = 1
                                }
                              + unit   = "ms"
                            }
                        }
                      + gridPos     = {
                          + h = 8
                          + w = 8
                          + x = 8
                          + y = 9
                        }
                      + targets     = [
                          + {
                              + expr         = "histogram_quantile(0.95, sum(rate(rpc_server_duration_milliseconds_bucket{job=~\"$service\"}[$__rate_interval])) by (le, job, rpc_method))"
                              + legendFormat = "{{ job }} / {{ rpc_method }}"
                              + refId        = "A"
                            },
                        ]
                      + title       = "RPC p95 by Method"
                      + type        = "timeseries"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + color      = {
                                  + mode = "thresholds"
                                }
                              + thresholds = {
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                      + {
                                          + color = "yellow"
                                          + value = 10000
                                        },
                                      + {
                                          + color = "red"
                                          + value = 50000
                                        },
                                    ]
                                }
                              + unit       = "short"
                            }
                        }
                      + gridPos     = {
                          + h = 4
                          + w = 8
                          + x = 16
                          + y = 9
                        }
                      + options     = {
                          + colorMode = "background"
                        }
                      + targets     = [
                          + {
                              + expr  = "sum(increase(rpc_server_requests_total{job=~\"$service\"}[24h]))"
                              + refId = "A"
                            },
                        ]
                      + title       = "Total Requests (24h)"
                      + type        = "stat"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + color      = {
                                  + mode = "thresholds"
                                }
                              + thresholds = {
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                      + {
                                          + color = "yellow"
                                          + value = 100
                                        },
                                      + {
                                          + color = "red"
                                          + value = 500
                                        },
                                    ]
                                }
                              + unit       = "short"
                            }
                        }
                      + gridPos     = {
                          + h = 4
                          + w = 8
                          + x = 16
                          + y = 13
                        }
                      + options     = {
                          + colorMode = "background"
                        }
                      + targets     = [
                          + {
                              + expr  = "sum(increase(rpc_server_requests_total{job=~\"$service\", rpc_connect_status_code!=\"ok\"}[24h]))"
                              + refId = "A"
                            },
                        ]
                      + title       = "Errors (24h)"
                      + type        = "stat"
                    },
                  + {
                      + collapsed = false
                      + gridPos   = {
                          + h = 1
                          + w = 24
                          + x = 0
                          + y = 17
                        }
                      + title     = "Security & Rate Limiting"
                      + type      = "row"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + color  = {
                                  + mode = "palette-classic"
                                }
                              + custom = {
                                  + drawStyle   = "bars"
                                  + fillOpacity = 50
                                  + lineWidth   = 1
                                }
                              + unit   = "short"
                            }
                        }
                      + gridPos     = {
                          + h = 8
                          + w = 8
                          + x = 0
                          + y = 18
                        }
                      + targets     = [
                          + {
                              + expr         = "sum(rate(shorted_rate_limit_blocked_total{job=\"shorted-api\"}[$__rate_interval])) by (tier)"
                              + legendFormat = "{{ tier }}"
                              + refId        = "A"
                            },
                        ]
                      + title       = "Rate Limit Blocks"
                      + type        = "timeseries"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + color  = {
                                  + mode = "palette-classic"
                                }
                              + custom = {
                                  + drawStyle   = "bars"
                                  + fillOpacity = 50
                                  + lineWidth   = 1
                                }
                              + unit   = "short"
                            }
                        }
                      + gridPos     = {
                          + h = 8
                          + w = 8
                          + x = 8
                          + y = 18
                        }
                      + targets     = [
                          + {
                              + expr         = "sum(rate(shorted_scraper_blocked_total{job=\"shorted-api\"}[$__rate_interval])) by (reason)"
                              + legendFormat = "{{ reason }}"
                              + refId        = "A"
                            },
                        ]
                      + title       = "Scraper / Bot Blocks"
                      + type        = "timeseries"
                    },
                  + {
                      + datasource = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + gridPos    = {
                          + h = 8
                          + w = 8
                          + x = 16
                          + y = 18
                        }
                      + options    = {
                          + legend        = {
                              + displayMode = "table"
                              + placement   = "right"
                            }
                          + reduceOptions = {
                              + calcs = [
                                  + "sum",
                                ]
                            }
                        }
                      + targets    = [
                          + {
                              + expr         = "sum(increase(shorted_auth_method_total{job=\"shorted-api\"}[24h])) by (method)"
                              + legendFormat = "{{ method }}"
                              + refId        = "A"
                            },
                        ]
                      + title      = "Auth Methods (24h)"
                      + type       = "piechart"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + color      = {
                                  + mode = "thresholds"
                                }
                              + thresholds = {
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                      + {
                                          + color = "yellow"
                                          + value = 50
                                        },
                                      + {
                                          + color = "red"
                                          + value = 200
                                        },
                                    ]
                                }
                              + unit       = "short"
                            }
                        }
                      + gridPos     = {
                          + h = 4
                          + w = 6
                          + x = 0
                          + y = 26
                        }
                      + options     = {
                          + colorMode = "background"
                        }
                      + targets     = [
                          + {
                              + expr  = "sum(increase(shorted_rate_limit_blocked_total{job=\"shorted-api\"}[24h]))"
                              + refId = "A"
                            },
                        ]
                      + title       = "Rate Limited (24h)"
                      + type        = "stat"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + color      = {
                                  + mode = "thresholds"
                                }
                              + thresholds = {
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                      + {
                                          + color = "yellow"
                                          + value = 20
                                        },
                                      + {
                                          + color = "red"
                                          + value = 100
                                        },
                                    ]
                                }
                              + unit       = "short"
                            }
                        }
                      + gridPos     = {
                          + h = 4
                          + w = 6
                          + x = 6
                          + y = 26
                        }
                      + options     = {
                          + colorMode = "background"
                        }
                      + targets     = [
                          + {
                              + expr  = "sum(increase(shorted_scraper_blocked_total{job=\"shorted-api\"}[24h]))"
                              + refId = "A"
                            },
                        ]
                      + title       = "Scrapers Blocked (24h)"
                      + type        = "stat"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + color = {
                                  + fixedColor = "orange"
                                  + mode       = "fixed"
                                }
                              + unit  = "short"
                            }
                        }
                      + gridPos     = {
                          + h = 4
                          + w = 6
                          + x = 12
                          + y = 26
                        }
                      + options     = {
                          + colorMode = "background"
                        }
                      + targets     = [
                          + {
                              + expr  = "sum(increase(shorted_auth_method_total{job=\"shorted-api\", method=\"anonymous\"}[24h]))"
                              + refId = "A"
                            },
                        ]
                      + title       = "Anonymous Requests (24h)"
                      + type        = "stat"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + color = {
                                  + fixedColor = "green"
                                  + mode       = "fixed"
                                }
                              + unit  = "short"
                            }
                        }
                      + gridPos     = {
                          + h = 4
                          + w = 6
                          + x = 18
                          + y = 26
                        }
                      + options     = {
                          + colorMode = "background"
                        }
                      + targets     = [
                          + {
                              + expr  = "sum(increase(shorted_auth_method_total{job=\"shorted-api\", method!=\"anonymous\"}[24h]))"
                              + refId = "A"
                            },
                        ]
                      + title       = "Authenticated (24h)"
                      + type        = "stat"
                    },
                  + {
                      + collapsed = false
                      + gridPos   = {
                          + h = 1
                          + w = 24
                          + x = 0
                          + y = 30
                        }
                      + title     = "HTTP Services"
                      + type      = "row"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + custom = {
                                  + drawStyle   = "line"
                                  + fillOpacity = 10
                                  + lineWidth   = 2
                                }
                              + unit   = "reqps"
                            }
                        }
                      + gridPos     = {
                          + h = 8
                          + w = 12
                          + x = 0
                          + y = 31
                        }
                      + targets     = [
                          + {
                              + expr         = "sum(rate(http_server_duration_milliseconds_count{job=~\"$service\"}[$__rate_interval])) by (job, http_route)"
                              + legendFormat = "{{ job }} / {{ http_route }}"
                              + refId        = "A"
                            },
                        ]
                      + title       = "HTTP Request Rate by Service"
                      + type        = "timeseries"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + custom = {
                                  + drawStyle   = "line"
                                  + fillOpacity = 5
                                  + lineWidth   = 2
                                }
                              + unit   = "ms"
                            }
                        }
                      + gridPos     = {
                          + h = 8
                          + w = 12
                          + x = 12
                          + y = 31
                        }
                      + targets     = [
                          + {
                              + expr         = "histogram_quantile(0.95, sum(rate(http_server_duration_milliseconds_bucket{job=~\"$service\"}[$__rate_interval])) by (le, job))"
                              + legendFormat = "{{ job }} p95"
                              + refId        = "A"
                            },
                        ]
                      + title       = "HTTP Duration p95 by Service"
                      + type        = "timeseries"
                    },
                  + {
                      + collapsed = false
                      + gridPos   = {
                          + h = 1
                          + w = 24
                          + x = 0
                          + y = 39
                        }
                      + title     = "Frontend (Next.js)"
                      + type      = "row"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + custom = {
                                  + drawStyle   = "line"
                                  + fillOpacity = 10
                                  + lineWidth   = 2
                                }
                              + unit   = "ms"
                            }
                        }
                      + gridPos     = {
                          + h = 8
                          + w = 12
                          + x = 0
                          + y = 40
                        }
                      + targets     = [
                          + {
                              + expr         = "histogram_quantile(0.95, sum(rate(http_server_duration_milliseconds_bucket{job=\"shorted-web\"}[$__rate_interval])) by (le, http_route))"
                              + legendFormat = "{{ http_route }}"
                              + refId        = "A"
                            },
                        ]
                      + title       = "Server Action Duration (p95)"
                      + type        = "timeseries"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + custom = {
                                  + drawStyle   = "line"
                                  + fillOpacity = 10
                                  + lineWidth   = 2
                                }
                              + unit   = "reqps"
                            }
                        }
                      + gridPos     = {
                          + h = 8
                          + w = 12
                          + x = 12
                          + y = 40
                        }
                      + targets     = [
                          + {
                              + expr         = "sum(rate(http_server_duration_milliseconds_count{job=\"shorted-web\"}[$__rate_interval])) by (http_route)"
                              + legendFormat = "{{ http_route }}"
                              + refId        = "A"
                            },
                        ]
                      + title       = "Frontend Request Rate"
                      + type        = "timeseries"
                    },
                  + {
                      + collapsed = false
                      + gridPos   = {
                          + h = 1
                          + w = 24
                          + x = 0
                          + y = 48
                        }
                      + title     = "Async Jobs & Data Pipeline"
                      + type      = "row"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults  = {
                              + custom = {
                                  + drawStyle   = "bars"
                                  + fillOpacity = 50
                                  + lineWidth   = 1
                                }
                            }
                          + overrides = [
                              + {
                                  + matcher    = {
                                      + id      = "byRegexp"
                                      + options = ".*success.*"
                                    }
                                  + properties = [
                                      + {
                                          + id    = "color"
                                          + value = {
                                              + fixedColor = "green"
                                              + mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              + {
                                  + matcher    = {
                                      + id      = "byRegexp"
                                      + options = ".*failure.*"
                                    }
                                  + properties = [
                                      + {
                                          + id    = "color"
                                          + value = {
                                              + fixedColor = "red"
                                              + mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                            ]
                        }
                      + gridPos     = {
                          + h = 8
                          + w = 12
                          + x = 0
                          + y = 49
                        }
                      + targets     = [
                          + {
                              + expr         = "sum(increase(shorted_sync_status_total[$__rate_interval])) by (sync_job, status)"
                              + legendFormat = "{{ sync_job }} / {{ status }}"
                              + refId        = "A"
                            },
                        ]
                      + title       = "Job Execution Status"
                      + type        = "timeseries"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + custom = {
                                  + drawStyle   = "line"
                                  + fillOpacity = 10
                                  + lineWidth   = 2
                                }
                              + unit   = "s"
                            }
                        }
                      + gridPos     = {
                          + h = 8
                          + w = 12
                          + x = 12
                          + y = 49
                        }
                      + targets     = [
                          + {
                              + expr         = "rate(shorted_sync_duration_seconds_sum[$__rate_interval]) / rate(shorted_sync_duration_seconds_count[$__rate_interval])"
                              + legendFormat = "{{ sync_job }}"
                              + refId        = "A"
                            },
                        ]
                      + title       = "Job Duration (avg)"
                      + type        = "timeseries"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + custom = {
                                  + drawStyle   = "line"
                                  + fillOpacity = 10
                                  + lineWidth   = 2
                                }
                              + unit   = "short"
                            }
                        }
                      + gridPos     = {
                          + h = 8
                          + w = 12
                          + x = 0
                          + y = 57
                        }
                      + targets     = [
                          + {
                              + expr         = "sum(increase(shorted_sync_records_processed_total[$__rate_interval])) by (sync_job)"
                              + legendFormat = "{{ sync_job }}"
                              + refId        = "A"
                            },
                        ]
                      + title       = "Records Processed"
                      + type        = "timeseries"
                    },
                  + {
                      + datasource  = {
                          + type = "prometheus"
                          + uid  = "grafanacloud-prom"
                        }
                      + fieldConfig = {
                          + defaults = {
                              + color      = {
                                  + mode = "thresholds"
                                }
                              + thresholds = {
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                      +

... (truncated — full plan available in workflow logs)

```

</details>

*Environment: dev*
*Project: shorted-dev-aba5688f*
*Image Tag: pr-84*
